Revit 2027 API
UIApplication.CanPostCommand Method
 Identifies if the given command can be posted, using PostCommand(RevitCommandId).
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanPostCommand(
	RevitCommandId commandId
)
Public Function CanPostCommand (
	commandId As RevitCommandId
) As Boolean
public:
bool CanPostCommand(
	RevitCommandId^ commandId
)
member CanPostCommand :
        commandId : RevitCommandId -> bool
Parameters
commandId RevitCommandId
 The command Id.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException | Thrown when commandId is null.
Remarks
 Only members of Autodesk.Revit.UI.PostableCommand or external commands can be posted.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace